#include<stdio.h>

int main(void)
{
    int n;
    scanf("%d", &n);

    int r, y, p;
    r = y = p = 0;
    for(r = 0; r <= n / 80; r ++)
    {
        for( y =0; y <= n / 50; y ++)
        {
            for(p = 0; p <= n / 35; p ++)
            {
                if((p * 3 == y || y == r * 2) && r*80 + y*50 + p * 35 == n)
                {
                    printf("r y p : %d %d %d\n",r, y, p);
                }
            }
        }
    }
    return 0;
}

/*
已知有红、黄、紫三种肥料，
价格分别为80元、50元、35元
每袋，现要根据经费采购肥料
编写一个程序，要求输入经费
费用n，（1000＜n＜2000），
输出满足以下两种条件之一的
所有购买方案：
（1）紫色的袋数是黄色的1/3
（2）黄色的袋数是红色的2倍
要求输出每种情况，并且按照
红、黄、紫的顺序输出


*/
